commands_templates/SetSerialPortConfiguration0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/deviceIO/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:SetSerialPortConfiguration>
         <wsdl:SerialPortConfiguration token="?" type="?">
            <!--type: int-->
            <wsdl:BaudRate>?</wsdl:BaudRate>
            <!--type: ParityBit - enumeration: [None,Even,Odd,Mark,Space,Extended]-->
            <wsdl:ParityBit>?</wsdl:ParityBit>
            <!--type: int-->
            <wsdl:CharacterLength>?</wsdl:CharacterLength>
            <!--type: float-->
            <wsdl:StopBit>?</wsdl:StopBit>
            <!--You may enter ANY elements at this point-->
         </wsdl:SerialPortConfiguration>
         <!--type: boolean-->
         <wsdl:ForcePersistance>?</wsdl:ForcePersistance>
      </wsdl:SetSerialPortConfiguration>
   </soap:Body>
</soap:Envelope>